[
    {
      "id": 1,
      "category": "Websites",
      "title": "Nielsen",
      "image": "/images/home/nielsen-md.jpg",
      "description": "Worked on building new dynamic blocks using Gutenberg. One creation was a dynamic chart js that allowed us to ingest Google sheets and create dynamic charts from it. Also improved performance and user usability.",
      "indepth" : "Utilized Alpine JS and Tailwind CSS to create dynamic, modern user interfaces that enhanced usability. Aligned development efforts with business objectives through close engagement with product owners to optimize project outcomes. Conducted thorough testing and debugging across multiple browsers and devices to ensure application reliability.",
      "bullets": [
        "Achieved seamless project execution by maintaining transparent communication on deadlines and project milestones.",
        "Led development of a block for rapid dynamic data visualization; reduced timeline from weeks to minutes for page implementation. ",
        "Improved user experience by ensuring accurate search results through implementation of an improved search API endpoint that allowed us to better handle custom post types.",
        "Reduced workload for editors and designers and accelerated project timelines by enabling writers to produce pages within days through the automation of Google Sheets chart creation." 
        ],
      "width": 300,
      "height": 300,
      "technologies" : [
        "Gutenberg",
        "Chart.js",
        "Google API",
        "WordPress",
        "JavaScript",
        "PHP",
        "React",
        "HTML",
        "CSS",
        "Tailwindcss",
        "AlpineJs",
        "Figma",
        "Git"
      ],
      "url" : "https://www.nielsen.com/"
    },
    {
      "id": 2,
      "category": "Websites",
      "title": "Learn Athlean-X",
      "image": "/images/home/learn-athleanx.png",
      "description": "Touched almost every part of this website. The backend is WordPress while the cart and products are all custom and JavaScript-based for usability.",
      "width": 300,
      "height": 300,
      "technologies" : [
        "Adobe Software",
        "Google API",
        "WordPress",
        "JavaScript",
        "PHP",
        "HTML",
        "CSS",
        "Jquery",
        "API Integrations",
        "Meta API",
        "MySQL",
        "Cpanel",
        "Git",
        "NPM",
        "SCSS"
      ],
      "indepth" : "Fully custom blog. Wordpress backend with in house theme and plugins to run day to day. Thousands of daily visitors, all custom tracking and promotionals. Pages designed in PSDs and coded off that.",
      "bullets": [
        "Fast pace environment with need to meet fast deadlines and quick page development.",
        "Added more features to WordPress editor to help with blog creation and flow. ",
        "Optimized CSS, JS, and theme functions to reduce load and increase performance by an average of 40 points.",
        "Svn management handled by TortiseSVN and moving to Git for more modern control." 
        ],
      "url" : "https://www.athleanx.com/"
    },
    {
      "id": 3,
      "category": "Websites",
      "title": "Athlean-X",
      "image": "/images/home/athleanx-md.jpg",
      "description": "The backend is a simple laravel while the cart and products are all custom and JavaScript-based for usability.",
      "width": 300,
      "height": 300,
      "technologies" : [
        "Adobe Software",
        "Google API",
        "Laravel",
        "JavaScript",
        "PHP",
        "HTML",
        "CSS",
        "Jquery",
        "API Integrations",
        "Meta API",
        "MySQL",
        "Cpanel",
        "Git",
        "composer"
      ],
      "indepth" : "Fully custom blog and ecommerce. Wordpress backend with in house theme and plugins to run day to day. Thousands of daily visitors, all custom tracking and promotionals. Pages designed in PSDs and coded off that.",
      "bullets": [
        "Fast pace environment with need to meet fast deadlines and quick page development.",
        "Added more features to WordPress editor to help with blog creation and flow. ",
        "Optimized CSS, JS, and theme functions to reduce load and increase performance by an average of 20 points.",
        "Svn management handled by TortiseSVN and moving to Git for more modern control." 
        ],
      "url" : "https://www.athleanx.com/"
    },
    {
      "id": 4,
      "category": "Websites",
      "title": "Athlean-X Portal",
      "image": "/images/home/athlean-online-md.jpg",
      "description": "Custom Zend 1 framework running a MVC application all custom. Including a custom API we have built to handle support and cross-server talk. I have added and modifed features including new models, new controllers and views.",
      "width": 300,
      "height": 300,
      "indepth" : "Complete in house user application allowing the usage of digital products brought on the E-commerce website. Very complex backend utilizing MVC layout with modern PHP class and integrations. I personally have done a entire redesing of the portal from a desktop first to mobile first as well as making it into a progressive web application, which means the app could run without connection to internet.",
      "bullets": [
        "Built a fully functioning progressive web application that flawlessly handled offline data.",
        "Fully fluent in the MVC architecture and have personally built out complex features or extensions to the application.",
        "Svn management handled by TortiseSVN.",
        "Managed by two people me and one other co-worker."
        ],
      "technologies" : [
        "Adobe Software",
        "Google API",
        "Zend",
        "JavaScript",
        "PHP",
        "HTML",
        "CSS",
        "Jquery",
        "API Integrations",
        "Meta API",
        "MySQL",
        "Cpanel"
      ],
      "url" : "https://www.portal.athleanx.com/"
    },
    {
        "id": 5,
        "category": "Websites",
        "title": "Antamba",
        "image": "/images/home/antamba-md.jpg",
        "description": "E-Commerce using Woocomerce, all style, design, and function is product of me for a client.",
        "width": 300,
        "height": 300,
        "indepth" : "Custom Woocommerce website with the intent to be the clients number one platform of sales. All the code is creation of mine with the input of the client.",
        "bullets": [
            "Fully integrated into Google and Facebook to help with trakcing.",
            "Opitmized images and pages for better SEO using principles I have learned."
        ],
        "technologies" : [
          "WordPress",
          "WooCommerce",
          "JavaScript",
          "PHP",
          "HTML",
          "CSS",
          "Jquery",
          "Meta API",
          "MySQL",
          "Cpanel"
        ],
        "url" : "https://www.antamba.com/"
      },
    {
      "id": 6,
      "category": "Websites",
      "title": "Island Painting",
      "image": "/images/home/island-painting-md.jpg",
      "description": "Simple promotional website for a local website. Backend is WordPress and I have a few plugins running to optimize speed as well as tracking.",
      "width": 300,
      "height": 300,
      "technologies" : [
        "WordPress",
        "JavaScript",
        "PHP",
        "HTML",
        "CSS",
        "Jquery",
        "Meta API",
        "MySQL",
        "Cpanel"
      ],
      "url" : "https://www.islandpaintinginc.com/"
    },
    {
      "id": 7,
      "category": "Websites",
      "title": "Bikerevier",
      "image": "/images/home/bikerevier.png",
      "description": "Redesigned and optimized the WordPress website for a small Swedish bicycle shop using WooCommerce, Elementor, custom CSS, and custom plugins. Updated the theme and styling to reflect a more modern, responsive design and improved the overall shopping flow for better usability and conversion. Enhanced product presentation, streamlined checkout, and ensured mobile-first performance across devices.",
      "width": 300,
      "height": 300,
      "technologies" : [
        "WordPress",
        "JavaScript",
        "PHP",
        "HTML",
        "CSS",
        "Jquery",
        "Meta API",
        "MySQL",
        "Cpanel"
      ],
      "url" : "https://bikerevier.ch/"
    }
  ]
